#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=3b8r]
module.gke.data.google_container_engine_versions.region: Reading...
module.gcp-network.module.vpc.google_compute_network.network: Refreshing state... [id=projects/github-actions-gcp/global/networks/gke-network-test]
module.gke.data.google_compute_zones.available: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/github-actions-gcp/serviceAccounts/tf-gke-gke0-test-3b8r@github-actions-gcp.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=github-actions-gcp/roles/logging.logWriter/serviceAccount:tf-gke-gke0-test-3b8r@github-actions-gcp.iam.gserviceaccount.com]
module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/gke-subnet-test"]: Refreshing state... [id=projects/github-actions-gcp/regions/europe-west1/subnetworks/gke-subnet-test]
module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/github-actions-gcp/regions/europe-west1]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=github-actions-gcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-gke0-test-3b8r@github-actions-gcp.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=github-actions-gcp/roles/monitoring.viewer/serviceAccount:tf-gke-gke0-test-3b8r@github-actions-gcp.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=github-actions-gcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-gke0-test-3b8r@github-actions-gcp.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2023-04-21 13:25:19.004942973 +0000 UTC]
module.gke.data.google_container_engine_versions.zone: Read complete after 1s [id=2023-04-21 13:25:19.231127165 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/github-actions-gcp/locations/europe-west1/clusters/gke0-test]
module.gke.google_container_node_pool.pools["node-pool"]: Refreshing state... [id=projects/github-actions-gcp/locations/europe-west1/clusters/gke0-test/nodePools/node-pool]
module.gke_auth.data.google_client_config.provider: Reading...
module.gke_auth.data.google_container_cluster.gke_cluster: Reading...
module.gke_auth.data.google_client_config.provider: Read complete after 1s [id=projects/"github-actions-gcp"/regions/<null>/zones/<null>]
module.gke_auth.data.google_container_cluster.gke_cluster: Read complete after 5s [id=projects/github-actions-gcp/locations/europe-west1/clusters/gke0-test]
local_file.kubeconfig: Refreshing state... [id=b7f0290555fbd3e716d2779c5a16ea17c9a428ec]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "kubeconfig-test"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @binarysta, Action: `pull_request`*